Revit 2027 API
ApplicationEntryPoint.CreateRibbonTab Method
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override void CreateRibbonTab(
	string tabName
)
Public Overrides Sub CreateRibbonTab (
	tabName As String
)
public:
virtual void CreateRibbonTab(
	String^ tabName
) override
abstract CreateRibbonTab :
        tabName : string -> unit
override CreateRibbonTab :
        tabName : string -> unit
Parameters
tabName String
See Also
Reference
ApplicationEntryPoint Class
Autodesk.Revit.UI.Macros Namespace